Revit 2026 API

# SynchronizeWithCentralOptionsRelinquishFamilyWorksets Property

---

Indicates whether Revit should relinquish Family worksets after synchronizing with central.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool RelinquishFamilyWorksets { get; }
```
```vb
Public ReadOnly Property RelinquishFamilyWorksets As Boolean
	Get
```
```cpp
public:
property bool RelinquishFamilyWorksets {
	bool get ();
}
```
```fsharp
member RelinquishFamilyWorksets : bool with get
```

#### Property Value

Boolean

This is a shortcut to access the value stored in FamilyWorksets.

#### Reference

SynchronizeWithCentralOptions Class

Autodesk.Revit.DB Namespace